# vim: ft=ruby
brew "fd"
brew "gh"
brew "git"
brew "git-lfs"
brew "tig"
brew "bat"
brew "fzf"
brew "zip"
brew "make"
brew "tmux"
brew "curl"
brew "wget"
brew "gzip"
brew "scdoc" # For manual pages
brew "ctags"
brew "ninja"
brew "cmake"
brew "cmake-docs"
brew "cppman" # TODO: fix this
brew "zoxide"
brew "rustup"
brew "ripgrep"
brew "pyright"
brew "luarocks" # Neovim lazy
brew "starship"
brew "graphviz" # dot language
brew "pkg-config"
brew "rustup-init"
brew "rust-analyzer"
brew "clang-format"

# tap "jgavris/rs-git-fsmonitor https://github.com/jgavris/rs-git-fsmonitor.git"
# brew "rs-git-fsmonitor"
