# vim: ft=ruby
brew "fd"
brew "gh"
brew "tig"
brew "bat"
brew "fzf"
brew "zip"
brew "tmux"
brew "wget"
brew "gzip"
brew "scdoc" # For manual pages
brew "ninja"
brew "cmake"
brew "cmake-docs"
brew "cppman" # TODO: fix this
brew "zoxide"
brew "pkgconf"
brew "rustup"
brew "ripgrep"
brew "pyright"
brew "luarocks" # Neovim lazy
brew "starship"
brew "rustup-init"
brew "clang-format"
brew "universal-ctags"

brew "zsh-completion"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# tap "jgavris/rs-git-fsmonitor https://github.com/jgavris/rs-git-fsmonitor.git"
# brew "rs-git-fsmonitor"
